Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: A source function assigns timestamps and emits watermarks through its SourceCon text object.
zh_cn: 数据源函分配时间戳和发出水位线需要依靠内部的SourceContext对象。

source: A source function can decide when to mark itself as idle
zh_cn: 数据源函数可以在任何时间通过调用SourceContext.markAsTemporarilyIdle()方法将自身标记为空闲状态。

source: A source function can replay its output if the external system that provides the data exposes an API to retrieve and reset a reading offset.
zh_cn: 如果外部系统提供了获取和重置读取偏移的相关接口，那么数据源函数就可以重放输出数据。

source: A source function emits a stream of records.
zh_cn: 源函数会发出一条记录流。

source: A source function that supports output replay needs to be integrated with Flink’s checkpointing mechanism and must persist all current reading positions when a checkpoint is taken.
zh_cn: 支持输出重放的数据源函数需要和Flink的检查点机制集成，并在生成检查点时持久化所有当前的读取位置。

source: A split operation that splits the input stream into a stream of white events and a stream of others
zh_cn: 将输入流拆分为白色事件和其他颜色事件的split操作。

source: A standalone Flink cluster consists of at least one master process and at least one TaskManager process that run on one or more machines.
zh_cn: 一个Flink独立集群至少包含一个主进程和一个TaskManager进程，它们可以运行在一台或多台机器上。

source: A state backend is responsible for two things: local state management and checkpointing state to a remote location.
zh_cn: 状态后端主要负责两件事：本地状态管理和将状态以检查点的形式写入远程存储。

source: A state backend takes care of checkpointing the state of a task to a remote and persistent storage.
zh_cn: 状态后端负责将任务状态以检查点形式写入远程持久化存储，

source: A state primitive defines the struc‐ ture of the state for an individual key.
zh_cn: 状态原语定义了单个键值对应的状态结构。

source: A stateful KeyedProcessFunction that cleans its state
zh_cn: 可以清除状态的KeyedProcessFunction

source: A stateful stream processing task
zh_cn: 带有状态的流处理任务

source: A stateful streaming application
zh_cn: 状态化流式应用

source: A stream processor that operates a data pipeline should also feature many source and sink connectors to read data from and write data to various storage sys‐ tems.
zh_cn: 执行数据管道应用的流处理引擎为了支持不同外部系统的数据读写，还需要提供多样化的数据源、数据汇连接器。

source: A stream processor that operates data pipelines should also fea‐ ture many source and sink connectors to read data from and write data to various storage systems and formats.
zh_cn: 执行数据管道的流处理引擎为了支持不同格式或外部系统的数据读写，还需要提供多样化的数据源、汇连接器。

source: A stream that is written to an event log can be read many times by the same or different consumers.
zh_cn: 写入事件日志的数据流可以被相同或不同的消费者重复读取。

source: A stream transformation is applied on one or more streams and converts them into one or more output streams.
zh_cn: 流式转换以一个或多个数据流为输入，并将它们转换成一个或多个输出流。

source: A stream with timestamped records and watermarks
zh_cn: 包含带有时间戳的记录及水位线的数据流

source: A stream with timestamped records and watermarks.
zh_cn: 带有时间戳记录和水位线的数据流。

source: A streaming analytics application
zh_cn: 流式分析应用示例

source: A streaming analytics application.
zh_cn: 流式分析应用示例

source: A streaming applica‐ tion cannot continue processing if the responsible JobManager process disappears.
zh_cn: 如果负责管理的JobManager进程消失，流式应用将无法继续处理数据。

source: A streaming operator with a UDF that turns each incoming event into a black event.
zh_cn: 带有UDF的流式算子会将每个到来的事件变黑。

source: A streaming operator with a function that turns each incoming event into a darker event
zh_cn: 带有函数的流式算子会将每个到来事件的颜色变深

source: A system scope
zh_cn: 一个系统域

source: A task maintains a partition watermark for each input partition.
zh_cn: 一个任务会为它的每个输入分区都维护一个分区水位线（partition watermark）。

source: A task might need to commit multiple transactions if an acknowledgment message is lost.
zh_cn: 如果某个确认消息丢失，任务可能需要一次提交多个事务。

source: A task of a stateful operator typically reads and updates its state for each incoming record.
zh_cn: 状态化算子的任务通常会对每一条到来的记录读写状态，

source: A task only acknowledges a checkpoint if the remote write succeeded.
zh_cn: 只有当远程写入成功后，任务才会确认检查点完成。

source: A task receives some input data.
zh_cn: 任务首先会接收一些输入数据。

source: A task tracks for each partition its current reading offset and includes it into its checkpoint data.
zh_cn: 任务会跟踪每一个它所负责分区的偏移，并将它们纳入到检查点数据之中。

source: A textbook setup consists of a stream processor, a batch pro‐
zh_cn: 一个典型的配置需要包含流处理引擎、批处理引擎、"提速"存储、批量存储和一系列负责向批处理引擎中加载数据及调度任务的工具。

source: A third option to specify keys are KeySelector functions.
zh_cn: 第三种指定键值的方法是使用KeySelector函数，

source: A topic is an event log that guaran‐ tees that events are read in the same order in which they were written.
zh_cn: 每个主题都是一个事件日志，其事件读取顺序和写入顺序完全相同。

source: A traditional approach to synchronize data in different storage systems is periodic ETL jobs.
zh_cn: 在不同存储系统间同步数据的传统方式是定期执行ETL作业，

source: A traditional data warehouse architecture for data analytics
zh_cn: 用于数据分析的传统数据仓库架构

source: A traditional data warehouse architecture for data analytics.
zh_cn: 用于数据分析的传统数据仓库架构。

source: A transaction must be open and accept writes for the duration of a checkpoint interval.
zh_cn: 在检查点的间隔期内，事务需要保持开启状态并允许数据写入。

source: A transaction must wait to be committed until a checkpoint completion notifica‐ tion is received.
zh_cn: 事务只有在接收到检查点完成通知后才可以提交。

source: A transactional sink that writes to files
zh_cn: 写文件的事务性数据汇

source: A trigger can decide based on assigned elements or registered timers (similar to a process function) to evaluate or purge the contents of its window at specific points in time.
zh_cn: 触发器可以根据已分配的元素或注册的计时器（类似处理函数）来决定在某些特定时刻执行计算或清除窗口中的内容。

source: A trigger can decide to fire based on progress in time- or data-specific conditions, such as element count or certain observed element values.
zh_cn: 它的触发条件可以是时间，也可以是某些特定的数据条件，如元素数量或某些观测到的元素值。

source: A trigger can define and use custom, per-window and per-key state.
zh_cn: 触发器中可以定义和使用针对每个窗口、每个键值的自定义状态。

source: A trigger can register timers to be called back at certain points in time—for example, to evaluate a window or purge its contents.
zh_cn: 你可以在触发器中注册计时器，用于在将来某个时间点触发回调（例如对窗口进行计算或清理其内容）。

source: A tumbling window assigner places elements into fixed-size, nonoverlapping windows
zh_cn: 滚动窗口分配器将元素放入大小固定且互不重叠的窗口中

source: A tumbling window assigner places elements into nonoverlapping, fixed-size win‐ dows, as shown in Figure 6-1.
zh_cn: 如图6-1所示，滚动窗口分配器会将元素放入大小固定且相互不重叠的窗口中。

source: A tumbling window assigner receives one parameter, the window
zh_cn: 滚动窗口分配器只接收一个参数：

source: A typical example is a stream of click events where clicks have a session id attribute that expires after some time.
zh_cn: 一个典型的例子是有一条包含会话id属性的点击事件流，其中的会话id会在一段时间后过期。

source: A union operation that merges two input streams into one
zh_cn: 将两条输入流合二为一的union操作

source: A value of -1 disables the REST API and
zh_cn: 将值设为-1表示禁用REST API和Web UI。

source: A watermark is a global progress metric that indicates a certain point in time when we are confident that no more delayed events will arrive.
zh_cn: 水位线是一个全局进度指标，表示我们确信再不会有延迟事件到来的某个时间点。

source: A watermark is a global progress metric that indicates the point in time when we are confident that no more delayed events will arrive.
zh_cn: 水位线是一个全局进度指标，表示我们确信不会再有延迟事件到来的某个时间点。

source: A watermark tells operators that no more events with a timestamp less than or equal to the watermark are expected.
zh_cn: 水位线用于告知算子不必再等那些时间戳小于或等于水位线的事件。

source: A watermark with a timestamp T indi‐ cates that all subsequent records should have timestamps > T.
zh_cn: 一个时间戳为T的水位线表示，接下来所有记录的时间戳一定都大于T。

source: A watermark with a timestamp t indicates that all subsequent records should have timestamps > t.
zh_cn: 一个拥有时间戳t的水位线表示，接下来所有记录的时间戳一定都大于t。

source: A welcoming community
zh_cn: 欢迎加入社区

source: A window assigner for tumbling event-time windows
zh_cn: 用于滚动事件时间窗口的窗口分配器

source: A window assigner produces a WindowedStream (or All WindowedStream if applied on a nonkeyed DataStream).
zh_cn: 窗口分配器会产生一个WindowedStream（如果用在非键值分区的DataStream上则是AllWindowedStream）。

source: A window assigner that determines how the elements of the input stream are grouped into windows.
zh_cn: 一个用于决定输入流中的元素该如何分组的窗口分配器（window assigner）。

source: A window function that is applied on a WindowedStream (or AllWindowedStream)
zh_cn: 一个作用于WindowedStream（或AllWindowedStream）上用于处理分配到窗口中元素的窗口函数。

source: A window is created when the WindowAssigner assigns the first element to it.
zh_cn: 窗口会在WindowAssigner首次对它分配元素时创建。

source: A window only stores the current result of
zh_cn: 窗口只需要存储当前聚合结果——

source: A window operator creates and typically also deletes windows while it processes incoming stream elements.
zh_cn: 窗口算子在处理到达的数据流元素时需要新建窗口，并且通常还需要将其删除。

source: A window operator with a full window function (the circles in each window represent its collected raw input records)
zh_cn: 配置了全量窗口函数的窗口算子（每个窗口内的圆圈表示收集的原始输入记录）

source: A window operator with allowed lateness will not delete a window and its state after the watermark passes the window’s end timestamp.
zh_cn: 配置了该属性的窗口算子在水位线超过窗口的结束时间戳之后不会立即删除窗口，

source: A window operator with an incremental aggregation and full window func‐ tion (the single circle in each window represents its aggregated window state)
zh_cn: 配置了增量聚合及全量窗口函数的窗口算子（每个窗口内的单个圆圈表示聚合后的窗口状态）

source: A window operator with an incremental aggregation function (the single cir‐ cle in each window represents its aggregated window state)
zh_cn: 配置了增量聚合函数的窗口算子（每个窗口内的单个圆圈表示聚合后的窗口状态）

source: API, each WindowAssigner has a default trigger that is used unless an explicit trigger
zh_cn: 系统对于没有显式定义触发器的WindowAssigner都会提供一个默认的触发器。

source: Ability to run streaming applications 24/7 with very little downtime due to its highly available setup (no single point of failure), tight integration with Kuber‐ netes, YARN, and Apache Mesos, fast recovery from failures, and the ability to dynamically scale jobs.
zh_cn: 支持高可用性配置（无单点失效），和Kubernetes、YARN、Apache Mesos紧密集成，快速故障恢复，动态扩缩容作业等。基于上述特点，它可以7×24小时运行流式应用，几乎无须停机。

source: Ability to update the application code of jobs and migrate jobs to different Flink clusters without losing the state of the application.
zh_cn: 允许在不丢失应用状态的前提下更新作业的程序代码或进行跨Flink集群的作业迁移。

source: About the Authors
zh_cn: 关于作者

source: Access to timestamps and watermarks through the API
zh_cn: 通过API访问时间戳和水位线

source: Accessing state stored by the RocksDB state back‐ end is slower but its state may grow very large.
zh_cn: 后者状态访问会慢一些，但允许状态变得很大。

source: Acknowledgments
zh_cn: 致谢

source: Action
zh_cn: 行为

source: Actually, every 5 seconds, Flink invokes the getCurrentWatermark() method of AssignerWithPeriodicWatermarks.
zh_cn: 实际上，Flink会每隔5秒调用一次AssignerWithPeriodicWatermarks中的getCurrentWatermark()方法。

source: Ad-hoc analysis of live data in consumer technology
zh_cn: 消费者技术中的实时数据即席分析

source: Ad-hoc analysis of live data in consumer technology.
zh_cn: 消费者技术中的实时数据即席分析等。

source: Adding a data processing system, such as Apache Flink, requires careful considera‐ tions because it does not include its own storage layer but relies on external storage systems to ingest and persist data.
zh_cn: 添加一个像Apache Flink这样的数据处理系统需要经过深思熟虑，因为它没有包含内置的存储层，而是依赖外部存储系统来传入和持久化数据。

source: Adding external dependencies is a common requirement when implementing Flink applications.
zh_cn: 在实现Flink应用时经常需要添加一些外部依赖。

source: Adding the following lines to your configuration will define a JMX reporter “my_reporter” that listens to ports
zh_cn: 你可以通过在配置中添加以下几行来定义一个名为"my_reporter"、监听端口9020-9040的JMX汇报器：

source: Additional require‐ ments to successfully support streaming analytics applications are support for event-time processing in order to produce correct and deterministic results and the ability to process large amounts of data in little time, i.e., high throughput.
zh_cn: 为了成功支持流式分析应用，还有一些额外需求：支持事件时间处理以便产生正确及确定的结果，能够在短时间内处理大量数据（高吞吐）等。

source: Additional requirements for data pipelines are the ability to process large amounts of data in short time, i.e., support for high throughput, and the capability to scale an application.
zh_cn: 它的额外需求是能够在短时间内处理大批量数据，即高吞吐和支持应用扩容。

source: Additionally, a KeyedPro cessFunction[KEY, IN, OUT] provides the following two methods:
zh_cn: 除此之外，KeyedProcessFunction[KEY, IN, OUT]还提供了以下两个方法：

source: Additionally, the stream processor needs to ensure internal state consistency.
zh_cn: 此外，流处理引擎需要确保内部状态的一致性，

source: Additionally, you can fast forward the computation to the present so that once your program catches up with the events happening now, it can continue as a real-time application using exactly the same program logic.
zh_cn: 此外，你可以把计算"快进"到现在，这样一旦你的程序赶上了当前事件产生的进度，它能够以完全相同的程序逻辑作为实时应用继续运行。

source: Additionally, you can fast-forward the computation to the present so that once your program catches
zh_cn: 此外，你可以把计算"快进"到现在，这样一旦你的程序赶上了当前事件产生的进度，它能够以相同的程序逻辑作为实时应用继续运行。

source: After all barriers are sent out, the source continues its regu‐ lar operations.
zh_cn: 在将所有分隔符发出后，数据源将恢复常规工作。

source: After all buffered records have been emitted, the task continues processing its input streams.
zh_cn: 待所有缓冲的记录处理完后，任务就会继续处理输入流。

source: After all, you probably gather metrics because you want to create a real-time dashboard or feed the measurements to another application.
zh_cn: 毕竟你收集指标的目的可能是要创建实时仪表盘或将测量数据发往另一个应用。

source: After an application is restarted from a checkpoint, its internal state is exactly the same as when the checkpoint was taken.
zh_cn: 应用从检查点恢复以后，它的内部状态会和生成检查点的时候完全一致。

source: After dividing a large file into multiple splits, the splits can be distributed to multiple reader tasks to read the file in parallel.
zh_cn: 在将一个大文件分割后，这些划分就可以分配给多个读取任务来并行读取。

source: After it has been started, a TaskManager registers its slots at the ResourceManager.
zh_cn: 在TaskManager启动后，会将它的处理槽在ResourceManager中注册。

source: After it has been started, a TaskManager registers its slots to the ResourceManager.
zh_cn: TaskManager在启动后，会向ResourceManager注册它的处理槽。

source: After reading this chapter, you will know how to implement a stream processing application with basic functionality.
zh_cn: 本章过后，你将了解如何实现一个具有基本功能的流处理应用。

source: After reading this chapter, you will know how to set up and configure a Flink cluster.
zh_cn: 阅读本章将使你了解如何搭建和配置Flink集群。

source: After starting, a TaskManager registers itself at the ResourceManager.
zh_cn: TaskManager启动后会在ResourceManager上注册自己。

source: Again, Flink does all of this.
zh_cn: Flink同样可以做到上述一切。

source: Again, Flink provides all required features to success‐ fully operate data pipelines and includes many connectors.
zh_cn: Flink 同样为执行数据管道提供了全部所需特性以及多种连接器。

source: Again, a Flink application must enable check‐
zh_cn: Flink应用依然需要启用检查点并从一个可重置的数据源消费数据。

source: Again, we hope you walk away from this book with a better understanding of the capabilities and possibilities of Apache Flink.
zh_cn: 我们希望你在读完本书后能够对Apache Flink的功能和潜力有一个更深的理解。

source: Aggregating State.get() computes the final result and returns it as an Iterable with a single element.
zh_cn: AggregatingState.get()方法会计算最终结果并将其作为Iterable中唯一的元素返回。

source: AggregatingState[I, O] behaves similar to ReducingState.
zh_cn: AggregatingState[I, O]和ReducingState行为类似，

source: Aggregation operations are stateful and combine the current state with the incoming event to produce an updated aggregate
zh_cn: 聚合操作都是状态化的，它们通过将新到来的事件合并到已有状态来生成更新后的聚合值。

source: Aggregation operations are stateful and combine the current state with the incoming event to produce an updated aggregate value.
zh_cn: 这些聚合操作是状态化的，它们通过将新到来的事件合并到已有状态来生成更新后的聚合值。

source: Alice is a devoted player who plays the game every morning during her commute to work.
zh_cn: 爱丽丝是个铁杆玩家，每天早晨上班路上都会玩这个游戏。

source: Alice keeps on playing and the game events are buffered in her phone.
zh_cn: 爱丽丝继续玩她的，此时游戏产生的事件会缓存在手机里。

source: All Java and Scala primitive types, such as Int (or Integer for Java), String, and Double, are supported.
zh_cn: Flink支持所有Java和Scala的原始类型，例如Int（Java中是Integer）、String和Double。

source: All assigners we discuss here are time-based and were introduced in “Operations on Data Streams” on page 22.
zh_cn: 所有接下来要讨论的分配器都是基于时间的，我们在第22页"数据流上的操作"一节对它们都做过介绍。

source: All built-in window assigners provide a default trigger that triggers the evaluation of a window once the (processing or event) time passes the end of the window.
zh_cn: 所有内置的窗口分配器都提供了一个默认的触发器，一旦（处理或事件）时间超过了窗口的结束时间就会触发窗口计算。

source: All events of the broadcasted stream are replicated and sent to all parallel operator instances of the subsequent processing function.
zh_cn: 所有广播流的事件都会被复制多份并分别发往后续处理函数所在算子的每个实例；

source: All events that are pro‐ cessed in the same parallel task of an operator have access to the same state.
zh_cn: 因此同一算子并行任务在处理任何事件时都可以访问相同的状态。

source: All external communication with Flink services—submitting and controlling applica‐ tions and accessing the REST interface—happens over REST/HTTP endpoints.8 You can enable SSL encryption for these connections as well.
zh_cn: 所有访问Flink服务的外部通信（提交和控制应用以及访问REST接口）都是通过REST/HTTP端点（endpoint）来进行的。8 你同样可以为这些连接启用SSL加密或相互验证。

source: All fields are public or accessible through getters and setters.
zh_cn: 所有字段都是公有的或提供了相应的getter及setter方法。

source: All fields have types that are supported by Flink.
zh_cn: 所有字段类型都必须是Flink所支持的。

source: All functions are evaluated by an individual task running in a dedicated thread.
zh_cn: 其中每个函数都交由单独的任务、在特定线程内处理。

source: All images you build afterwards in this shell are deployed to Mini‐ kube’s image registry.
zh_cn: 之后你在此Shell中构建的所有镜像都会部署到Minikube的镜像注册表中了，

source: All issues related to state consistency, failure handling, and efficient storage and access are taken care of by Flink so that developers can focus on the logic of their applications.
zh_cn: 所有和状态一致性、故障处理以及高效存取相关的问题都由Flink负责搞定，这样开发人员就可以专注于自己的应用逻辑。

source: All of the previously mentioned use cases for savepoints follow the same pattern.
zh_cn: 所有之前提到的保存点相关用例都遵循同一个模式。

source: All of these parameters need to be added to Flink’s configuration file (./conf/flink-conf.yaml).
zh_cn: 所有这些都需要作为参数添加到Flink的配置文件（./conf/flink-conf.yaml）中。

source: All of these systems are typically designed with
zh_cn: 如图1-1所示，上述类型的应用系统通常都会设置独立的数据处理层（应用程序自身）和数据存储层（事务性数据库系统）。

source: All of these systems store data in different formats and data structures that provide the best performance for their specific access pattern.
zh_cn: 为了在各自访问模式下都能达到最佳性能，上述系统会将数据以不同格式或数据结构存储。

source: All of these systems store data in different representations and data structures that provide the best performance for their specific purpose.
zh_cn: 为了达到各自场景下的最佳性能，上述系统会以不同表示形式或数据结构存储数据。

source: All other dependencies an application requires must be explicitly provided.
zh_cn: 对于应用的其它依赖则必须显式提供。

source: All parameters can be defined in the ./conf/flink-conf.yaml file, which is organized as a flat YAML file of key-value pairs.
zh_cn: 所有这些参数都可以在./conf/flink-conf.yaml文件中定义。该文件是一个存储键值的扁平化YAML文件，

source: All parameters can be explicitly specified within the code of an application as described in “Tuning Checkpointing and Recovery”.
zh_cn: 所有参数都可以在应用代码中显式指定（详见"调整检查点和恢复"一节）。

source: All process functions implement the RichFunction interface and hence offer open(), close(), and getRuntimeContext() methods.
zh_cn: 所有处理函数都实现了RichFunction接口，因此可以提供open()、close()、getRunteimContext()等方法。

source: All processes are manually started, and there is no component that monitors these processes and restarts them in case of a failure.
zh_cn: 所有进程都是手动启动，不存在用于监视和在它们发生故障时将其重启的组件。

source: All processes run as regular Java JVM processes.
zh_cn: 所有进程都是作为普通的JVM进程来运行。

source: All records are correctly written and the sendValues() method returns true; however, the program fails before CheckpointCommitter is called or Checkpoint Committer fails to commit the checkpoint.
zh_cn: 所有记录都已成功写入，setValues()方法返回true，但程序在调用CheckpointCommitter前出现故障或CheckpointCommitter未能成功提交检查点。

source: All records that are processed by a Flink event-time streaming application must be accompanied by a timestamp.
zh_cn: 由Flink事件时间流式应用处理的所有记录都必须包含时间戳。

source: All records with a timestamp greater than a given timestamp (requires Kafka
zh_cn: 所有时间戳大于某个给定值的记录（需要Kafka 0.10.x或之后的版本）：

source: All scripts only work for local setups.
zh_cn: 所有脚本都只适用于本地搭建。

source: All started TaskManager processes register themselves at the active ResourceManager.
zh_cn: 所有启动后的TaskManager进程都会将自己在活动的ResourceManager中注册。

source: All state primitives can be cleared by calling State.clear().
zh_cn: 所有状态原语都支持调用State.clear()方法来进行清除。

source: All tasks of operators that are members of the same slot-sharing group are processed by the same slots.
zh_cn: 所属同一处理槽共享组的算子，其任务都会由相同的处理槽处理。

source: All the window types that you have seen so far are global windows and operate on the full stream.
zh_cn: 至今为止你所见到的所有窗口都是基于全流数据的全局窗口（global window）。

source: All the window types that you have seen so far are windows that operate on the full stream.
zh_cn: 迄今为止你所见到的所有窗口都是基于全流数据的全局窗口（global window）。

source: All the window types that you have seen so far need to buffer data before performing an operation.
zh_cn: 至今为止所有你看到的窗口类型都要在执行实际操作前缓冲数据。

source: All the window types that you have seen so far need to buffer data before producing a result.
zh_cn: 至今为止你见到的所有窗口类型都要在生成结果前缓冲数据。

source: All these use cases require collecting real-time data, analyzing it with low latency, and immediately reacting to the result.
zh_cn: 所有这些用例都需要收集实时数据、进行低延迟地分析并立即响应结果，

source: All transformations in this section produce a DataStream whereas keyBy() results in a KeyedStream, on which transformation with access to keyed state can be applied.
zh_cn: 所有本节介绍的转换都会生成一个DataStream，而keyBy()会生成一个KeyedStream。基于后者可以应用那些能够访问键值分区状态的转换。

source: All you have to do is define a function with keyed state and make the state queryable by calling the set Queryable(String) method on the StateDescriptor before obtaining the state han‐ dle.
zh_cn: 你要做的就是定义一个具有键值分区状态的函数，然后在获取状态句柄之前调用StateDescriptor的setQueryable(String)方法。这样，目标状态就变为可查询的了。

source: All you have to do is start an application with the run command and additionally provide a path to a savepoint
zh_cn: 你只需在使用run命令启动应用时利用-s选项提供额外的保存点路径即可：

source: Allowed lateness can be specified using the allowedLateness() method as Example 6-22 demonstrates.
zh_cn: 如示例6-22所示，我们可以使用allowedLateness()方法指定延迟容忍度。

source: Along with the previously discussed window functions, these components work together in a window operator to group and process elements in windows.
zh_cn: 这些组件可以和之前讨论的窗口函数协同工作，一起实现对于元素的窗口化分组和处理。

source: Also the internals of a stream processor that supports event-time are more involved than the internals of a system that purely operates in processing-time.
zh_cn: 此外，相比纯粹使用处理时间，支持事件时间的流处理引擎内部要更加复杂。

source: Also, a checkpoint will not fail because a local state copy failed.
zh_cn: 同时，检查点也不会因为本地状态副本出现问题而失败。

source: Also, the ProcessWindowFunction.clear() method is invoked to clean up all custom per-window state.
zh_cn: 同时，调用ProcessWindowFunction.clear()方法来清理那些自定义的单个窗口状态。

source: Also, the internals of a stream processor that supports event time are more involved than the internals of a system that purely operates in processing time.
zh_cn: 此外，相比纯粹使用处理时间的引擎，支持事件时间的流处理引擎内部要更加复杂。

source: Also, the overall result of the streaming appli‐ cation will be in an inconsistent state while the replay is in progress because some results will be overridden while others are not.
zh_cn: 同时，在重放进行过程中，由于某些结果会被覆盖而某些则不会，所以流式应用的整体结果将处于不一致的状态。

source: Also, the versions of values for multiple keys might be out of sync.
zh_cn: 同时，对于多个键的值而言，其版本可能会不同步。

source: Alterna‐ tively, Flink provides a feature called queryable state which allows users to expose the state of an application as a key-lookup table and make it accessible for external appli‐ cations.
zh_cn: 而Flink提供了一项名为可查询状态（queryable state）的功能，允许用户将应用的状态以键查表（key-lookup table）的形式发布出去，供其他外部应用访问。

source: Alternately, a 95th-percentile latency value of 10 ms means that 95% of events are processed within 10 ms.
zh_cn: 而第95百分位延迟在10毫秒意味着95%的事件会在10毫秒内处理。

source: Although a program is executed in a single JVM, records are serialized for cross- thread communication and possibly state persistance.
zh_cn: 虽然程序运行在单个JVM内，但出于跨线程通信和潜在的状态持久化需求考虑，记录都会被序列化。
